Revit 2024 API
ParameterTypeId.ViewSolarstudyAnimationSpeedValue Property
 "Loop animation speed"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ViewSolarstudyAnimationSpeedValue { get; }
Visual Basic
Public Shared ReadOnly Property ViewSolarstudyAnimationSpeedValue As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ViewSolarstudyAnimationSpeedValue {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace